soap2/cxfisppsoap/deposit.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.4-b01-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.4-b01-. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://dcsf.gov.uk/ISPP/Webservice" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://dcsf.gov.uk/ISPP/Webservice" name="ISPPDepositImplService">
<types>
<xsd:schema>
<xsd:import namespace="http://dcsf.gov.uk/ISPP/Webservice/encodedTypes" schemaLocation="deposit.xsd" />
</xsd:schema>
</types>
<message name="upload">
<part xmlns:ns1="http://dcsf.gov.uk/ISPP/Webservice/encodedTypes" name="doc" element="ns1:uploadRequest" />
</message>
<message name="uploadResponse">
<part xmlns:ns2="http://dcsf.gov.uk/ISPP/Webservice/encodedTypes" name="result" element="ns2:uploadResponse" />
</message>
<portType name="ISPPPortType">
<operation name="upload">
<input message="tns:upload" />
<output message="tns:uploadResponse" />
</operation>
</portType>
<binding name="ISPPPortTypePortBinding" type="tns:ISPPPortType">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
<operation name="upload">
<soap:operation soapAction="" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
</binding>
<service name="ISPPDepositImplService">
<port name="ISPPPortTypePort" binding="tns:ISPPPortTypePortBinding">
<soap:address location="http://aggregator.openfamilyservices.org.uk:80/isppsoap/deposit" />
</port>
</service>
</definitions>
